sergev/LiteBSD/sys/mips/pic32/trap.c
/*
 * Copyright (c) 1988 University of Utah.
 * Copyright (c) 1992, 1993
 *      The Regents of the University of California.  All rights reserved.
 *
 * This code is derived from software contributed to Berkeley by
 * the Systems Programming Group of the University of Utah Computer
 * Science Department and Ralph Campbell.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. All advertising materials mentioning features or use of this software
 *    must display the following acknowledgement:
 *      This product includes software developed by the University of
 *      California, Berkeley and its contributors.
 * 4. Neither the name of the University nor the names of its contributors
 *    may be used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 *
 * from: Utah $Hdr: trap.c 1.32 91/04/06$
 *
 *      @(#)trap.c      8.7 (Berkeley) 6/2/95
 */

#include <sys/param.h>
#include <sys/systm.h>
#include <sys/proc.h>
#include <sys/kernel.h>
#include <sys/signalvar.h>
#include <sys/syscall.h>
#include <sys/user.h>
#include <sys/buf.h>
#ifdef KTRACE
#include <sys/ktrace.h>
#endif
#include <net/netisr.h>

#include <machine/trap.h>
#include <machine/psl.h>
#include <machine/reg.h>
#include <machine/cpu.h>
#include <machine/pte.h>
#include <machine/mips_opcode.h>
#include <machine/pic32mz.h>

#include <vm/vm.h>
#include <vm/vm_kern.h>
#include <vm/vm_page.h>

extern void MachKernGenException();
extern void MachUserGenException();
extern void MachKernIntr();
extern void MachUserIntr();
extern void MachTLBModException();
extern void MachTLBMissException();

void (*machExceptionTable[])() = {
    /*
     * The kernel exception handlers.
     */
    MachKernIntr,           /* 0  - 00 Int    External interrupt */
    MachKernGenException,   /* 1  - 01 MOD    TLB modification */
    MachTLBMissException,   /* 2  - 02 TLBL   TLB miss (load or instr. fetch) */
    MachTLBMissException,   /* 3  - 03 TLBS   TLB miss (store) */
    MachKernGenException,   /* 4  - 04 AdEL   Address error (load or I-fetch) */
    MachKernGenException,   /* 5  - 05 AdES   Address error (store) */
    MachKernGenException,   /* 6  - 06 IBE    Bus error (I-fetch) */
    MachKernGenException,   /* 7  - 07 DBE    Bus error (load or store) */
    MachKernGenException,   /* 8  - 08 Sys    System call */
    MachKernGenException,   /* 9  - 09 Bp     Breakpoint */
    MachKernGenException,   /* 10 - 0a RI     Reserved instruction */
    MachKernGenException,   /* 11 - 0b CPU    Coprocessor unusable */
    MachKernGenException,   /* 12 - 0c Ov     Arithmetic overflow */
    MachKernGenException,   /* 13 - 0d Tr     Trap */
    MachKernGenException,   /* 14 - 0e -      Reserved */
    MachKernGenException,   /* 15 - 0f -      Reserved */
    MachKernGenException,   /* 16 - 10 -      Reserved */
    MachKernGenException,   /* 17 - 11 -      Reserved */
    MachKernGenException,   /* 18 - 12 -      Reserved */
    MachKernGenException,   /* 19 - 13 TLBRI  TLB read-inhibit */
    MachKernGenException,   /* 20 - 14 TLBEI  TLB execute-inhibit */
    MachKernGenException,   /* 21 - 15 -      Reserved */
    MachKernGenException,   /* 22 - 16 -      Reserved */
    MachKernGenException,   /* 23 - 17 WATCH  Watch point */
    MachKernGenException,   /* 24 - 18 MCheck Machine check */
    MachKernGenException,   /* 25 - 19 -      Reserved */
    MachKernGenException,   /* 26 - 1A DSPDis DSP disabled */
    MachKernGenException,   /* 27 - 1B -      Reserved */
    MachKernGenException,   /* 28 - 1C -      Reserved */
    MachKernGenException,   /* 29 - 1D -      Reserved */
    MachKernGenException,   /* 30 - 1E -      Reserved */
    MachKernGenException,   /* 31 - 1F -      Reserved */

    /*
     * The user exception handlers.
     */
    MachUserIntr,           /* 0  - 00 Int    External interrupt */
    MachUserGenException,   /* 1  - 01 MOD    TLB modification */
    MachUserGenException,   /* 2  - 02 TLBL   TLB miss (load or instr. fetch) */
    MachUserGenException,   /* 3  - 03 TLBS   TLB miss (store) */
    MachUserGenException,   /* 4  - 04 AdEL   Address error (load or I-fetch) */
    MachUserGenException,   /* 5  - 05 AdES   Address error (store) */
    MachUserGenException,   /* 6  - 06 IBE    Bus error (I-fetch) */
    MachUserGenException,   /* 7  - 07 DBE    Bus error (load or store) */
    MachUserGenException,   /* 8  - 08 Sys    System call */
    MachUserGenException,   /* 9  - 09 Bp     Breakpoint */
    MachUserGenException,   /* 10 - 0a RI     Reserved instruction */
    MachUserGenException,   /* 11 - 0b CPU    Coprocessor unusable */
    MachUserGenException,   /* 12 - 0c Ov     Arithmetic overflow */
    MachUserGenException,   /* 13 - 0d Tr     Trap */
    MachUserGenException,   /* 14 - 0e -      Reserved */
    MachUserGenException,   /* 15 - 0f -      Reserved */
    MachUserGenException,   /* 16 - 10 -      Reserved */
    MachUserGenException,   /* 17 - 11 -      Reserved */
    MachUserGenException,   /* 18 - 12 -      Reserved */
    MachUserGenException,   /* 19 - 13 TLBRI  TLB read-inhibit */
    MachUserGenException,   /* 20 - 14 TLBEI  TLB execute-inhibit */
    MachUserGenException,   /* 21 - 15 -      Reserved */
    MachUserGenException,   /* 22 - 16 -      Reserved */
    MachUserGenException,   /* 23 - 17 WATCH  Watch point */
    MachUserGenException,   /* 24 - 18 MCheck Machine check */
    MachUserGenException,   /* 25 - 19 -      Reserved */
    MachUserGenException,   /* 26 - 1A DSPDis DSP disabled */
    MachUserGenException,   /* 27 - 1B -      Reserved */
    MachUserGenException,   /* 28 - 1C -      Reserved */
    MachUserGenException,   /* 29 - 1D -      Reserved */
    MachUserGenException,   /* 30 - 1E -      Reserved */
    MachUserGenException,   /* 31 - 1F -      Reserved */
};

