sergev/LiteBSD/sys/mips/pic32/trap.c
/*
 * Handle an exception.
 * Called from MachKernGenException() or MachUserGenException()
 * when a processor trap occurs.
 * In the case of a kernel trap, we return the pc where to resume if
 * ((struct pcb *)UADDR)->pcb_onfault is set, otherwise, return old pc.
 */
unsigned
trap(statusReg, causeReg, vadr, pc, args)
    unsigned statusReg;     /* status register at time of the exception */
    unsigned causeReg;      /* cause register at time of exception */
    unsigned vadr;          /* address (if any) the fault occured on */
    unsigned pc;            /* program counter where to continue */
{
    register int type, i;
    unsigned ucode = 0;
    register struct proc *p = curproc;
    u_quad_t sticks;
    vm_prot_t ftype;
    extern unsigned onfault_table[];

    cnt.v_trap++;

    /*
     * Enable hardware interrupts if they were on before.
     * We only respond to software interrupts when returning to user mode.
     */
    if (statusReg & MACH_Status_IE) {
        int ipl = CURPRI(statusReg);
        if (ipl < 2)
            spl2();
        else
            splx(statusReg);
    }

    type = (causeReg & MACH_Cause_ExcCode) >> MACH_Cause_ExcCode_SHIFT;
    if (USERMODE(statusReg)) {
        type |= T_USER;
        sticks = p->p_sticks;
    }
    switch (type) {
    case T_TLB_MOD:
        /* check for kernel address */
        if ((int)vadr < 0) {
            register pt_entry_t *pte;
            register unsigned entry;
            register vm_offset_t pa;

            pte = kvtopte(vadr);
            entry = pte->pt_entry;
#ifdef DIAGNOSTIC
            if (!(entry & PG_V) || (entry & PG_M))
                panic("trap: ktlbmod: invalid pte");
#endif
            if (entry & PG_RO) {
                /* write to read only page in the kernel */
                ftype = VM_PROT_WRITE;
                goto kernel_fault;
            }
            entry |= PG_M;
            pte->pt_entry = entry;
            vadr &= ~PGOFSET;
            MachTLBUpdate(vadr, entry);
            pa = entry & PG_FRAME;
#ifdef ATTR
            pmap_attributes[atop(pa)] |= PMAP_ATTR_MOD;
#else
            if (!IS_VM_PHYSADDR(pa))
                panic("trap: ktlbmod: unmanaged page");
            PHYS_TO_VM_PAGE(pa)->flags &= ~PG_CLEAN;
#endif
            return (pc);
        }
        /* FALLTHROUGH */

    case T_TLB_MOD+T_USER:
        {
        register pt_entry_t *pte;
        register unsigned entry;
        register vm_offset_t pa;
        pmap_t pmap = &p->p_vmspace->vm_pmap;

        if (!(pte = pmap_segmap(pmap, vadr)))
            panic("trap: utlbmod: invalid segmap");
        pte += (vadr >> PGSHIFT) & (NPTEPG - 1);
        entry = pte->pt_entry;
#ifdef DIAGNOSTIC
        if (!(entry & PG_V) || (entry & PG_M))
            panic("trap: utlbmod: invalid pte");
#endif
        if (entry & PG_RO) {
            /* write to read only page */
            ftype = VM_PROT_WRITE;
            goto dofault;
        }
        entry |= PG_M;
        pte->pt_entry = entry;
        vadr = (vadr & ~PGOFSET) |
            (pmap->pm_tlbpid << VMMACH_TLB_PID_SHIFT);
        MachTLBUpdate(vadr, entry);
        pa = entry & PG_FRAME;
#ifdef ATTR
        pmap_attributes[atop(pa)] |= PMAP_ATTR_MOD;
#else
        if (!IS_VM_PHYSADDR(pa))
            panic("trap: utlbmod: unmanaged page");
        PHYS_TO_VM_PAGE(pa)->flags &= ~PG_CLEAN;
#endif
        if (!USERMODE(statusReg))
            return (pc);
        goto out;
        }

    case T_TLB_LD_MISS:
    case T_TLB_ST_MISS:
        ftype = (type == T_TLB_ST_MISS) ? VM_PROT_WRITE : VM_PROT_READ;
        /* check for kernel address */
        if ((int)vadr < 0) {
            register vm_offset_t va;
            int rv;

        kernel_fault:
            va = trunc_page((vm_offset_t)vadr);
            rv = vm_fault(kernel_map, va, ftype, FALSE);
            if (rv == KERN_SUCCESS)
                return (pc);
            i = ((struct pcb *)UADDR)->pcb_onfault;
            if (i) {
                ((struct pcb *)UADDR)->pcb_onfault = 0;
                return (onfault_table[i]);
            }
            goto err;
        }
        /*
         * It is an error for the kernel to access user space except
         * through the copyin/copyout routines.
         */
        i = ((struct pcb *)UADDR)->pcb_onfault;
        if (i == 0)
            goto err;
        /* check for fuswintr() or suswintr() getting a page fault */
        if (i == 4)
            return (onfault_table[i]);
        goto dofault;

    case T_TLB_LD_MISS+T_USER:
        ftype = VM_PROT_READ;
        goto dofault;

    case T_TLB_ST_MISS+T_USER:
        ftype = VM_PROT_WRITE;
    dofault:
        {
        register vm_offset_t va;
        register struct vmspace *vm;
        register vm_map_t map;
        int rv;

        vm = p->p_vmspace;
        map = &vm->vm_map;
        va = trunc_page((vm_offset_t)vadr);
        rv = vm_fault(map, va, ftype, FALSE);
        /*
         * If this was a stack access we keep track of the maximum
         * accessed stack size.  Also, if vm_fault gets a protection
         * failure it is due to accessing the stack region outside
         * the current limit and we need to reflect that as an access
         * error.
         */
        if ((caddr_t)va >= vm->vm_maxsaddr) {
            if (rv == KERN_SUCCESS) {
                unsigned nss;

                nss = clrnd(btoc(USRSTACK-(unsigned)va));
                if (nss > vm->vm_ssize)
                    vm->vm_ssize = nss;
            } else if (rv == KERN_PROTECTION_FAILURE)
                rv = KERN_INVALID_ADDRESS;
        }
        if (rv == KERN_SUCCESS) {
            if (!USERMODE(statusReg))
                return (pc);
            goto out;
        }
        if (! USERMODE(statusReg)) {
            i = ((struct pcb *)UADDR)->pcb_onfault;
            if (i) {
                ((struct pcb *)UADDR)->pcb_onfault = 0;
                return (onfault_table[i]);
            }
            goto err;
        }
        ucode = vadr;
        i = (rv == KERN_PROTECTION_FAILURE) ? SIGBUS : SIGSEGV;
        break;
        }

    case T_ADDR_ERR_LD+T_USER:      /* misaligned or kseg access */
    case T_ADDR_ERR_ST+T_USER:      /* misaligned or kseg access */
    case T_BUS_ERR_IFETCH+T_USER:   /* BERR asserted to cpu */
    case T_BUS_ERR_LD_ST+T_USER:    /* BERR asserted to cpu */
        i = SIGSEGV;
        break;

    case T_SYSCALL+T_USER:
        {
        register int *locr0 = p->p_md.md_regs;
        register struct sysent *callp;
        unsigned int code;
        int numsys;
        struct args {
            int i[8];
        } args;
        int rval[2];
        struct sysent *systab;
        extern int nsysent;

        cnt.v_syscall++;
        /* Compute next PC after syscall instruction.
         * Don't use syscall in branch delay slot. */
        locr0[PC] += 4;
        systab = sysent;
        numsys = nsysent;
        code = locr0[V0];
        switch (code) {
        case SYS_syscall:
            /*
             * Code is first argument, followed by actual args.
             */
            code = locr0[A0];
            if (code >= numsys)
                callp = &systab[SYS_syscall]; /* (illegal) */
            else
                callp = &systab[code];
            i = callp->sy_argsize;
            args.i[0] = locr0[A1];
            args.i[1] = locr0[A2];
            args.i[2] = locr0[A3];
            if (i > 3 * sizeof(register_t)) {
                i = copyin((caddr_t)(locr0[SP] +
                        4 * sizeof(register_t)),
                    (caddr_t)&args.i[3],
                    (u_int)(i - 3 * sizeof(register_t)));
                if (i) {
                    locr0[V0] = i;
                    locr0[A3] = 1;
#ifdef KTRACE
                    if (KTRPOINT(p, KTR_SYSCALL))
                        ktrsyscall(p->p_tracep, code,
                            callp->sy_argsize,
                            args.i);
#endif
                    goto done;
                }
            }
            break;

        case SYS___syscall:
            /*
             * Like syscall, but code is a quad, so as to maintain
             * quad alignment for the rest of the arguments.
             */
            code = locr0[A0 + _QUAD_LOWWORD];
            if (code >= numsys)
                callp = &systab[SYS_syscall]; /* (illegal) */
            else
                callp = &systab[code];
            i = callp->sy_argsize;
            args.i[0] = locr0[A2];
            args.i[1] = locr0[A3];
            if (i > 2 * sizeof(register_t)) {
                i = copyin((caddr_t)(locr0[SP] +
                        4 * sizeof(register_t)),
                    (caddr_t)&args.i[2],
                    (u_int)(i - 2 * sizeof(register_t)));
                if (i) {
                    locr0[V0] = i;
                    locr0[A3] = 1;
#ifdef KTRACE
                    if (KTRPOINT(p, KTR_SYSCALL))
                        ktrsyscall(p->p_tracep, code,
                            callp->sy_argsize,
                            args.i);
#endif
                    goto done;
                }
            }
            break;

        default:
            if (code >= numsys)
                callp = &systab[SYS_syscall]; /* (illegal) */
            else
                callp = &systab[code];
            i = callp->sy_argsize;
            args.i[0] = locr0[A0];
            args.i[1] = locr0[A1];
            args.i[2] = locr0[A2];
            args.i[3] = locr0[A3];
            if (i > 4 * sizeof(register_t)) {
                i = copyin((caddr_t)(locr0[SP] +
                        4 * sizeof(register_t)),
                    (caddr_t)&args.i[4],
                    (u_int)(i - 4 * sizeof(register_t)));
                if (i) {
                    locr0[V0] = i;
                    locr0[A3] = 1;
#ifdef KTRACE
                    if (KTRPOINT(p, KTR_SYSCALL))
                        ktrsyscall(p->p_tracep, code,
                            callp->sy_argsize,
                            args.i);
#endif
                    goto done;
                }
            }
        }
#ifdef KTRACE
        if (KTRPOINT(p, KTR_SYSCALL))
            ktrsyscall(p->p_tracep, code, callp->sy_argsize, args.i);
#endif
        rval[0] = 0;
        rval[1] = locr0[V1];

        i = (*callp->sy_call)(p, &args, rval);
        /*
         * Reinitialize proc pointer `p' as it may be different
         * if this is a child returning from fork syscall.
         */
        p = curproc;
        locr0 = p->p_md.md_regs;

        switch (i) {
        case 0:
            locr0[V0] = rval[0];
            locr0[V1] = rval[1];
            locr0[A3] = 0;
            break;

        case ERESTART:
            locr0[PC] = pc;
            break;

